USE [Дипломное_проектирование]
GO

INSERT INTO Студенты (ФИО, Код_студента, средний_балл_успеваемости, код_группы, код_специальности)
VALUES
	('Алексей Иванов', 1001, 4.5, 'D099', '8D07101'),
	('Иван Петров', 1002, 4.7, 'D103', '8D07102'),
    ('Мария Сидорова', 1003, 3.9, 'D104', '8D07103'),
    ('Ольга Смирнова', 1004, 4.6, 'D103', '8D07104'),
    ('Дмитрий Кузнецов', 1005, 4.8, 'D099', '8D07105'),
    ('Петр Романов', 1006, 3.7, 'D103', '8D07106'),
    ('Анастасия Горбунова', 1008, 4.0, 'D116', '8D07201'),
    ('Сергей Попов', 1009, 4.3, 'D120', '8D07202'),
    ('Наталья Волкова', 1010, 4.4, 'D117', '8D07203')