CREATE DATABASE Фонотека
ON 
(
    NAME = 'MyDBroot',
    FILENAME = 'C:\Program Files\Microsoft SQL Server\MSSQL14.SQLEXPRESS\MSSQL\DATA\fonoteka.mdf',
    SIZE = 8MB,
    MAXSIZE = 50MB,
    FILEGROWTH = 5MB
)
LOG ON
(
    NAME = 'Logdata1',
    FILENAME = 'C:\Program Files\Microsoft SQL Server\MSSQL14.SQLEXPRESS\MSSQL\DATA\fonoteka_log.ldf',
    SIZE = 5MB,
    MAXSIZE = 25MB,
    FILEGROWTH = 5MB
);

USE Фонотека;


CREATE TABLE КатегорииДисков (
    КодКатегорииДиска INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL UNIQUE
);

CREATE TABLE Страны (
    КодСтраны INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL UNIQUE
);

CREATE TABLE Исполнители (
    КодИсполнителя INT PRIMARY KEY,
    ФИО_или_Наименование CHAR(70) NOT NULL
);

CREATE TABLE АвторыМузыки (
    КодАвтораМузыки INT PRIMARY KEY,
    ФИО_или_Наименование CHAR(70) NOT NULL
);

CREATE TABLE АвторыТекста (
    КодАвтораТекста INT PRIMARY KEY,
    ФИО_или_Наименование CHAR(70) NOT NULL
);

CREATE TABLE КатегорииПроизведений (
    КодКатегории INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL UNIQUE
);


CREATE TABLE МузыкальныеПроизведения (
    КодПроизведения INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL,
    КодКатегории INT NULL,
    Текст TEXT NULL,
    КодАвтораТекста INT NULL,
    КодАвтораМузыки INT NULL,
    КодИсполнителя INT NULL,
    CHECK (LEN(Наименование) > 0),
    FOREIGN KEY (КодКатегории) REFERENCES КатегорииПроизведений(КодКатегории),
    FOREIGN KEY (КодАвтораТекста) REFERENCES АвторыТекста(КодАвтораТекста),
    FOREIGN KEY (КодАвтораМузыки) REFERENCES АвторыМузыки(КодАвтораМузыки),
    FOREIGN KEY (КодИсполнителя) REFERENCES Исполнители(КодИсполнителя)

);


CREATE TABLE Диск (
    КодДиска INT PRIMARY KEY,
    Наименование CHAR(70) NOT NULL,
    ДатаВыпуска DATE,
    КодКатегорииДиска INT NULL,
    КодТипаИсполнителя INT NULL,
    КодСтраны INT NULL,
    ПродолжительностьЗвучания TIME NULL,
    ЦенаЗалоговая DECIMAL(10,2) CHECK (ЦенаЗалоговая > 0),
    СтоимостьАрендыЗаДень DECIMAL(10,2) CHECK (СтоимостьАрендыЗаДень >= 0),
    ОбщееКоличествоЭкземпляров INT CHECK (ОбщееКоличествоЭкземпляров >= 0),
    НаличиеЭкземпляров INT CHECK (НаличиеЭкземпляров >= 0),
    FOREIGN KEY (КодКатегорииДиска) REFERENCES КатегорииДисков(КодКатегорииДиска),
    FOREIGN KEY (КодТипаИсполнителя) REFERENCES Исполнители(КодИсполнителя),
    FOREIGN KEY (КодСтраны) REFERENCES Страны(КодСтраны)
);


CREATE TABLE СодержимоеДисков (
    КодДиска INT,
    КодМузыкальногоПроизведения INT,
    PRIMARY KEY (КодДиска, КодМузыкальногоПроизведения),
    FOREIGN KEY (КодДиска) REFERENCES Диск(КодДиска),  
    FOREIGN KEY (КодМузыкальногоПроизведения) REFERENCES МузыкальныеПроизведения(КодПроизведения)
        
);


CREATE TABLE Клиент (
    КодКлиента INT PRIMARY KEY,
    ФИОКлиента CHAR(70) NOT NULL,
    АдресПроживания CHAR(100),
    Телефон CHAR(15) UNIQUE CHECK (Телефон LIKE '[0-9]%')
);


CREATE TABLE Движение (
    НомерЗаписи INT PRIMARY KEY,
    НомерДиска INT NULL,
    КодКлиента INT NULL,
    ДатаВыдачи DATE NOT NULL,
    СрокВыдачи INT CHECK (СрокВыдачи > 0),
    ДатаВозврата DATE NULL,
    FOREIGN KEY (НомерДиска) REFERENCES Диск(КодДиска),
    FOREIGN KEY (КодКлиента) REFERENCES Клиент(КодКлиента)
);



INSERT INTO КатегорииДисков (КодКатегорииДиска, Наименование) VALUES
(1, 'Рок'),
(2, 'Поп'),
(3, 'Классика'),
(4, 'Джаз'),
(5, 'Электронная музыка'),
(6, 'Фолк'),
(7, 'Кантри'),
(8, 'Хип-хоп'),
(9, 'Регги'),
(10, 'Металл');


INSERT INTO Страны (КодСтраны, Наименование) VALUES
(1, 'Россия'),
(2, 'США'),
(3, 'Германия'),
(4, 'Великобритания'),
(5, 'Франция'),
(6, 'Япония'),
(7, 'Китай'),
(8, 'Италия'),
(9, 'Испания'),
(10, 'Австралия');


INSERT INTO Исполнители (КодИсполнителя, ФИО_или_Наименование) VALUES
(1, 'Джон Леннон'),
(2, 'Боб Дилан'),
(3, 'Бьорк'),
(4, 'Тейлор Свифт'),
(5, 'Канье Уэст'),
(6, 'Эминем'),
(7, 'Майкл Джексон'),
(8, 'Леди Гага'),
(9, 'Леонард Коэн'),
(10, 'Эд Ширан');



INSERT INTO АвторыМузыки (КодАвтораМузыки, ФИО_или_Наименование) VALUES
(1, 'Людвиг ван Бетховен'),
(2, 'Вольфганг Амадей Моцарт'),
(3, 'Джон Леннон'),
(4, 'Боб Дилан'),
(5, 'Тейлор Свифт'),
(6, 'Канье Уэст'),
(7, 'Фредди Меркьюри'),
(8, 'Бьорк'),
(9, 'Эминем'),
(10, 'Леди Гага');





INSERT INTO АвторыТекста (КодАвтораТекста, ФИО_или_Наименование) VALUES
(1, 'Боб Дилан'),
(2, 'Тейлор Свифт'),
(3, 'Майкл Джексон'),
(4, 'Леонард Коэн'),
(5, 'Канье Уэст'),
(6, 'Леди Гага'),
(7, 'Джон Леннон'),
(8, 'Эминем'),
(9, 'Бьорк'),
(10, 'Фредди Меркьюри');



INSERT INTO КатегорииПроизведений (КодКатегории, Наименование) VALUES
(1, 'Мелодия'),
(2, 'Балада'),
(3, 'Опера'),
(4, 'Гимн'),
(5, 'Рок-баллада'),
(6, 'Песня'),
(7, 'Фолк'),
(8, 'Кантри'),
(9, 'Танцевальная'),
(10, 'Инструментальная');



INSERT INTO МузыкальныеПроизведения (КодПроизведения, Наименование, КодКатегории, Текст, КодАвтораТекста, КодАвтораМузыки, КодИсполнителя) VALUES
(1, 'Imagine', 1, 'Imagine all the people living life in peace...', 1, 3, 1),
(2, 'Like a Rolling Stone', 2, 'Once upon a time you dressed so fine...', 2, 4, 2),
(3, 'Bad Romance', 5, 'I want your love and I want your revenge...', 6, 8, 6),
(4, 'Billie Jean', 1, 'She says I am the one...', 4, 7, 7),
(5, 'Bohemian Rhapsody', 6, 'Is this the real life? Is this just fantasy...', 10, 7, 9),
(6, 'Poker Face', 9, 'I wanna hold ’em like they do in Texas, please...', 6, 8, 6),
(7, 'Smells Like Teen Spirit', 3, 'With the lights out, it’s less dangerous...', 8, 7, 8),
(8, 'Thriller', 1, 'It’s close to midnight...', 4, 7, 7),
(9, 'Hallelujah', 2, 'Now I’ve heard there was a secret chord...', 3, 9, 9),
(10, 'Shake It Off', 7, 'And the players gonna play, play, play...', 2, 5, 4),
(11, 'Lose Yourself', 2, 'Look, if you had one shot, or one opportunity...', 8, 9, 8),
(12, 'Let It Be', 3, 'When I find myself in times of trouble...', 1, 3, 1),
(13, 'Blinding Lights', 6, 'I’ve been tryna call...', 5, 5, 4),
(14, 'Rolling in the Deep', 2, 'We could have had it all...', 2, 4, 5),
(15, 'Shape of You', 1, 'The club isn’t the best place to find a lover...', 4, 5, 10),
(16, 'Someone Like You', 3, 'I heard that you’re settled down...', 2, 5, 4),
(17, 'Firework', 9, 'Do you ever feel like a plastic bag...', 2, 8, 6),
(18, 'All of Me', 6, 'Cause all of me loves all of you...', 7, 9, 10),
(19, 'Uptown Funk', 1, 'This hit, that ice cold...', 9, 7, 6),
(20, 'Hey Jude', 5, 'Hey Jude, don’t make it bad...', 1, 3, 1);



INSERT INTO Диск (КодДиска, Наименование, ДатаВыпуска, КодКатегорииДиска, КодТипаИсполнителя, КодСтраны, ПродолжительностьЗвучания, ЦенаЗалоговая, СтоимостьАрендыЗаДень, ОбщееКоличествоЭкземпляров, НаличиеЭкземпляров) VALUES
(1, 'Let It Be', '1970-05-08', 3, 1, 1, '00:45:00', 300.00, 25.00, 50, 50),
(2, 'Thriller', '1982-11-30', 2, 7, 2, '00:42:00', 500.00, 35.00, 100, 100),
(3, 'The Dark Side of the Moon', '1973-03-01', 1, 9, 3, '00:43:00', 350.00, 30.00, 70, 70),
(4, 'Abbey Road', '1969-09-26', 1, 1, 4, '00:47:00', 400.00, 28.00, 60, 60),
(5, 'Born to Run', '1975-08-25', 4, 5, 5, '00:38:00', 250.00, 20.00, 30, 30),
(6, 'Hotel California', '1976-12-08', 5, 6, 6, '00:44:00', 450.00, 32.00, 80, 80),
(7, 'The Wall', '1979-11-30', 1, 8, 7, '01:00:00', 600.00, 40.00, 120, 120),
(8, 'Sticky Fingers', '1971-04-23', 2, 9, 8, '00:42:00', 500.00, 38.00, 110, 110),
(9, 'Back in Black', '1980-07-25', 1, 10, 9, '00:41:00', 450.00, 36.00, 90, 90),
(10, 'The Beatles', '1968-11-22', 1, 1, 10, '00:35:00', 350.00, 28.00, 50, 50),
(11, 'Born This Way', '2011-05-23', 2, 6, 6, '00:45:00', 400.00, 30.00, 80, 80),
(12, 'The Fame Monster', '2009-11-18', 2, 6, 8, '00:38:00', 350.00, 28.00, 75, 75),
(13, 'Lover', '2019-08-23', 5, 4, 5, '00:45:00', 375.00, 29.00, 65, 65),
(14, 'Good Kid, M.A.A.D City', '2012-10-22', 7, 8, 7, '00:50:00', 420.00, 32.00, 90, 90),
(15, 'A Night at the Opera', '1975-11-21', 3, 9, 9, '00:43:00', 480.00, 35.00, 100, 100),
(16, 'The Chronic', '1992-12-15', 8, 8, 2, '00:56:00', 450.00, 33.00, 60, 60),
(17, 'Graduation', '2007-09-11', 9, 7, 5, '00:50:00', 500.00, 36.00, 120, 120),
(18, 'Future Nostalgia', '2020-03-27', 1, 10, 6, '00:40:00', 350.00, 30.00, 85, 85),
(19, 'Views', '2016-04-29', 1, 4, 6, '00:48:00', 475.00, 34.00, 95, 95),
(20, 'Take Care', '2011-11-15', 9, 8, 5, '00:52:00', 420.00, 32.00, 110, 110);


INSERT INTO СодержимоеДисков (КодДиска, КодМузыкальногоПроизведения) VALUES
(1, 12),
(1, 13),
(1, 14),
(1, 15),
(2, 1),
(2, 2),
(2, 3),
(2, 4),
(3, 5),
(3, 6),
(3, 7),
(3, 8),
(4, 9),
(4, 10),
(4, 11),
(4, 12),
(5, 13),
(5, 14),
(5, 15),
(5, 16),
(6, 17),
(6, 18),
(6, 19),
(6, 20),
(7, 1),
(7, 2),
(7, 3),
(7, 4),
(8, 5),
(8, 6),
(8, 7),
(8, 8),
(9, 9),
(9, 10),
(9, 11),
(9, 12),
(10, 13),
(10, 14),
(10, 15),
(10, 16),
(11, 17),
(11, 18),
(11, 19),
(11, 20),
(12, 1),
(12, 2),
(12, 3),
(12, 4),
(13, 5),
(13, 6),
(13, 7),
(13, 8),
(14, 9),
(14, 10),
(14, 11),
(14, 12),
(15, 13),
(15, 14),
(15, 15),
(15, 16),
(16, 17),
(16, 18),
(16, 19),
(16, 20);



INSERT INTO Клиент (КодКлиента, ФИОКлиента, АдресПроживания, Телефон) VALUES
(1, 'Иван Иванов', 'Москва, ул. Ленина, 10', '89001112201'),
(2, 'Петр Петров', 'Санкт-Петербург, ул. Пушкина, 5', '89001112202'),
(3, 'Сергей Сергеев', 'Новосибирск, ул. Свердлова, 15', '89001112203'),
(4, 'Анна Антонова', 'Екатеринбург, ул. Чехова, 12', '89001112204'),
(5, 'Мария Васильева', 'Казань, ул. Мира, 3', '89001112205'),
(6, 'Александр Алексеев', 'Нижний Новгород, ул. Горького, 8', '89001112206'),
(7, 'Елена Еленова', 'Ростов-на-Дону, ул. Калинина, 9', '89001112207'),
(8, 'Максим Максимов', 'Волгоград, ул. Дзержинского, 6', '89001112208'),
(9, 'Ольга Орлова', 'Челябинск, ул. Ленина, 20', '89001112209'),
(10, 'Дмитрий Дмитриев', 'Томск, ул. Карла Маркса, 18', '89001112210'),
(11, 'Виктор Викторов', 'Краснодар, ул. 40 лет Победы, 7', '89001112211'),
(12, 'Ирина Ирина', 'Пермь, ул. Победы, 25', '89001112212'),
(13, 'Ярослав Ярославов', 'Барнаул, ул. Маяковского, 14', '89001112213'),
(14, 'Евгений Евгеньев', 'Тюмень, ул. Гагарина, 9', '89001112214'),
(15, 'Татьяна Татьянова', 'Сочи, ул. Курортная, 5', '89001112215'),
(16, 'Никита Никитин', 'Уфа, ул. Ленина, 2', '89001112216'),
(17, 'Оксана Оксарова', 'Владивосток, ул. Карла Маркса, 16', '89001112217'),
(18, 'Роман Романов', 'Иркутск, ул. Свердлова, 11', '89001112218'),
(19, 'Андрей Андреев', 'Калуга, ул. Чехова, 4', '89001112219'),
(20, 'Юлия Юлиева', 'Самара, ул. Пролетарская, 8', '89001112220');



INSERT INTO Движение (НомерЗаписи, НомерДиска, КодКлиента, ДатаВыдачи, СрокВыдачи, ДатаВозврата) VALUES
(1, 1, 1, '2023-10-01', 7, '2023-10-08'),
(2, 2, 2, '2023-10-02', 5, '2023-10-07'),
(3, 3, 3, '2023-10-03', 10, '2023-10-13'),
(4, 4, 4, '2023-10-04', 3, '2023-10-07'),
(5, 5, 5, '2023-10-05', 14, '2023-10-19'),
(6, 6, 6, '2023-10-06', 7, '2023-10-13'),
(7, 7, 7, '2023-10-07', 21, '2023-10-28'),
(8, 8, 8, '2023-10-08', 4, '2023-10-12'),
(9, 9, 9, '2023-10-09', 8, '2023-10-17'),
(10, 10, 10, '2023-10-10', 5, '2023-10-15'),
(11, 11, 11, '2023-10-11', 12, '2023-10-23'),
(12, 12, 12, '2023-10-12', 3, '2023-10-15'),
(13, 13, 13, '2023-10-13', 6, '2023-10-19'),
(14, 14, 14, '2023-10-14', 7, '2023-10-21'),
(15, 15, 15, '2023-10-15', 10, '2023-10-25'),
(16, 16, 16, '2023-10-16', 5, '2023-10-21'),
(17, 17, 17, '2023-10-17', 6, '2023-10-23'),
(18, 18, 18, '2023-10-18', 8, '2023-10-26'),
(19, 19, 19, '2023-10-19', 4, '2023-10-23'),
(20, 20, 20, '2023-10-20', 9, '2023-10-29');
