CREATE OR ALTER FUNCTION fn_DocsWithExecutors()
RETURNS TABLE
AS
RETURN
(
    SELECT
        r.[Номер_документа],
        d.[Наименование] AS [Документ],
        z.[ФИО] AS [Заявитель],
        e.[ФИО] AS [Исполнитель],
        m.[Дата_получения_документа],
        m.[Дата_окончания_исполнения],
        st.[Наименование] AS [Статус]
    FROM [Регистрация] r
    JOIN [Документы] d ON r.[Код_документа] = d.[Код]
    JOIN [Анкета_заявителя] z ON r.[Код_заявителя] = z.[Код_заявителя]
    JOIN [Движение] m ON r.[Номер_документа] = m.[Код_документа]
    JOIN [Сотрудники] e ON m.[Код_сотрудника_исполнителя] = e.[Код]
    JOIN [Статус_документа] st ON r.[Статус] = st.[Код]
);
GO